IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 X PIC 9(3).
01 MSG PIC X(20).
PROCEDURE DIVISION.
    MOVE 10 TO X.
    ADD 5 TO X.
    SUBTRACT 2 FROM X.
    DISPLAY X.
    MOVE 'Hello, COBOL' TO MSG.
    DISPLAY MSG.
    STOP RUN.
